app/controllers/enterprises_controller.rb

SELECT "enterprises".* FROM "enterprises"
---
  def index
    @enterprises = Enterprise.all

SELECT  "enterprises".* FROM "enterprises" WHERE "enterprises"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_enterprise
      @enterprise = Enterprise.find(params[:id])