app/controllers/holdings_controller.rb

  def index
    @holdings = Holding.all
---
SELECT "holdings".* FROM "holdings"

  def create
    @holding = Holding.new(holding_params)

    respond_to do |format|
      if @holding.save
---
INSERT INTO "holdings" ("name", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Holding 1"], ["active", "t"], ["created_at", "2017-04-26 01:36:11.357902"], ["updated_at", "2017-04-26 01:36:11.357902"]]

    def set_holding
      @holding = Holding.find(params[:id])
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]